In [2]:
import pandas as pd

# Series

In [3]:
temp = pd.Series([10,20,30,40])
print(temp)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
temp[0]

10

# Series Index 설정

In [5]:
temp = pd.Series([10,20,30,40], index=['One','Two','Three','Four'])
print(temp)

One      10
Two      20
Three    30
Four     40
dtype: int64

In [6]:
temp['One']

10

# DataFrame

In [7]:
data = {
    '이름' : ['A','B','C','D','E'],
    '나이' : [14,15,16,17,18],
    '번호' : [1,2,3,4,5]
} #객체 형태
data

{'이름': ['A', 'B', 'C', 'D', 'E'],
 '나이': [14, 15, 16, 17, 18],
 '번호': [1, 2, 3, 4, 5]}

In [8]:
type(data)

dict

In [9]:
df = pd.DataFrame(data)
df

  이름  나이  번호
0  A  14   1
1  B  15   2
2  C  16   3
3  D  17   4
4  E  18   5

In [10]:
df[['이름', '번호']]

  이름  번호
0  A   1
1  B   2
2  C   3
3  D   4
4  E   5

# DataFrame Index 설정

In [11]:
df = pd.DataFrame(data, index = ['첫번째','두번째','세번째','네번째','다섯번째'])
df

     이름  나이  번호
첫번째   A  14   1
두번째   B  15   2
세번째   C  16   3
네번째   D  17   4
다섯번째  E  18   5

# DataFrame Columns 설정

In [12]:
df = pd.DataFrame(data, columns=['이름','번호','나이'])
df

  이름  번호  나이
0  A   1  14
1  B   2  15
2  C   3  16
3  D   4  17
4  E   5  18

In [13]:
df.index.name='선수번호'
df

     이름  번호  나이
선수번호
0     A   1  14
1     B   2  15
2     C   3  16
3     D   4  17
4     E   5  18

In [14]:
df.set_index('이름')

    번호  나이
이름
A    1  14
B    2  15
C    3  16
D    4  17
E    5  18

In [15]:
df.sort_index(ascending = False) #내림차순 정렬, True 일 경우 오름차순

     이름  번호  나이
선수번호
4     E   5  18
3     D   4  17
2     C   3  16
1     B   2  15
0     A   1  14

In [16]:
data = {
    '이름' : ['A','B','C','D','E'],
    '나이' : [14,15,16,17,18],
    '번호' : [1,2,3,4,5],
    '국어' : [55,66,77,88,99],
    '수학' : [33,22,44,11,66],
    '영어' : [11,22,11,66,32]
} #객체 형태
df = pd.DataFrame(data)
df

  이름  나이  번호  국어  수학  영어
0  A  14   1  55  33  11
1  B  15   2  66  22  22
2  C  16   3  77  44  11
3  D  17   4  88  11  66
4  E  18   5  99  66  32

# 파일로 저장하기

In [17]:
df = pd.DataFrame(data, index = [1,2,3,4,5])
df

  이름  나이  번호  국어  수학  영어
1  A  14   1  55  33  11
2  B  15   2  66  22  22
3  C  16   3  77  44  11
4  D  17   4  88  11  66
5  E  18   5  99  66  32

In [18]:
df.index.name = '순위'

In [19]:
df

   이름  나이  번호  국어  수학  영어
순위
1   A  14   1  55  33  11
2   B  15   2  66  22  22
3   C  16   3  77  44  11
4   D  17   4  88  11  66
5   E  18   5  99  66  32

In [20]:
data = {
    '이름' : ['Kanye','Tyler','Wayne','Yachty','Drake'],
    '나이' : [42,31,43,24,33],
    '음악' : [100,95,52,88,12],
    '국어' : [55,66,77,88,99],
    '수학' : [33,22,44,11,66],
    '영어' : [11,22,11,66,32]
} #객체 형태
df = pd.DataFrame(data, index=[1,2,3,4,5])
df.index.name = '순위'
df
#df.to_csv('ranking.csv', encoding='utf-8-sig') #csv 파일로 변환, 위치 : C:\Users\Speria\anaconda3\Scripts\Python

In [21]:
#df.to_csv('ranking.txt', sep='\t') #표처럼 만들기

# 파일 열기

In [22]:
#df = pd.read_csv('ranking.csv') #skiprows : 처음 n줄 무시, nrows : n줄만 가져옴

In [33]:
data = {
    '이름' : ['Kanye','Tyler','Wayne','Yachty','Drake'],
    '나이' : [42,31,43,24,33],
    '음악' : [100,95,52,88,12],
    '국어' : [55,66,77,88,99],
    '수학' : [33,22,44,11,66],
    '영어' : [11,22,11,66,32]
} #객체 형태
df = pd.DataFrame(data, index=[1,2,3,4,5])
df.index.name = '순위'
df

        이름  나이   음악  국어  수학  영어
순위
1    Kanye  42  100  55  33  11
2    Tyler  31   95  66  22  22
3    Wayne  43   52  77  44  11
4   Yachty  24   88  88  11  66
5    Drake  33   12  99  66  32

# DataFrame 확인

In [34]:
df.describe()

             나이          음악         국어         수학         영어
count   5.00000    5.000000   5.000000   5.000000   5.000000
mean   34.60000   69.400000  77.000000  35.200000  28.400000
std     7.95613   37.199462  17.392527  21.158922  22.766203
min    24.00000   12.000000  55.000000  11.000000  11.000000
25%    31.00000   52.000000  66.000000  22.000000  11.000000
50%    33.00000   88.000000  77.000000  33.000000  22.000000
75%    42.00000   95.000000  88.000000  44.000000  32.000000
max    43.00000  100.000000  99.000000  66.000000  66.000000

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 1 to 5
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      5 non-null      object
 1   나이      5 non-null      int64
 2   음악      5 non-null      int64
 3   국어      5 non-null      int64
 4   수학      5 non-null      int64
 5   영어      5 non-null      int64
dtypes: int64(5), object(1)
memory usage: 280.0+ bytes

In [36]:
df.head()  #처음 다섯개의 row 를 불러오기

        이름  나이   음악  국어  수학  영어
순위
1    Kanye  42  100  55  33  11
2    Tyler  31   95  66  22  22
3    Wayne  43   52  77  44  11
4   Yachty  24   88  88  11  66
5    Drake  33   12  99  66  32

In [39]:
df.head(2) #처음 두개의 row 를 불러오기

       이름  나이   음악  국어  수학  영어
순위
1   Kanye  42  100  55  33  11
2   Tyler  31   95  66  22  22

In [37]:
df.sample() #아무 row 나 가져오기

       이름  나이  음악  국어  수학  영어
순위
2   Tyler  31  95  66  22  22

In [38]:
df.tail(2) #마지막 2개의 row 를 가져오기

        이름  나이  음악  국어  수학  영어
순위
4   Yachty  24  88  88  11  66
5    Drake  33  12  99  66  32

In [40]:
df.values

array([['Kanye', 42, 100, 55, 33, 11],
       ['Tyler', 31, 95, 66, 22, 22],
       ['Wayne', 43, 52, 77, 44, 11],
       ['Yachty', 24, 88, 88, 11, 66],
       ['Drake', 33, 12, 99, 66, 32]], dtype=object)

In [41]:
df.index

Int64Index([1, 2, 3, 4, 5], dtype='int64', name='순위')

In [42]:
df.columns

Index(['이름', '나이', '음악', '국어', '수학', '영어'], dtype='object')

In [43]:
df.shape #(row, column)

(5, 6)

In [44]:
df

        이름  나이   음악  국어  수학  영어
순위
1    Kanye  42  100  55  33  11
2    Tyler  31   95  66  22  22
3    Wayne  43   52  77  44  11
4   Yachty  24   88  88  11  66
5    Drake  33   12  99  66  32

In [45]:
df['음악'].min() #음악 부문 최하점

12

In [46]:
df['수학'].max()

66

In [47]:
df['음악'].nlargest(3) #가장 점수 높은 순서대로 3명

순위
1    100
2     95
4     88
Name: 음악, dtype: int64

In [48]:
df['음악'].mean() #음악 부문 평균 #sum은 합계

69.4